app/controllers/pages_controller.rb

SELECT "posts".* FROM "posts"
---
  def welcome
    @posts = Post.all